{"timeline":{"headline":"The Singapore Education Story","type":"default","startDate":"1822","text":"Let us take a trip down memory lane and witness how the Singapore education system has evolved over the years by looking at the major educational events and changes that have occurred.","asset":{"media":"http://educity.sg/img/singapore_view_small.jpg","credit":"","caption":""},"date": 
[{"startDate":"1823","headline":"First formal education institution in Singapore ","text":"In 1823, Sir Thomas Stamford Raffles founded the first formal school in Singapore - Singapore Institution (now known as Raffles Institution) <br /><a target='_blank' href='http://e-journal.um.edu.my/filebank/published_article/2388/730.pdf'>Source</a>","asset":{"media":"http://3.bp.blogspot.com/_NaQzJRmm6QI/TBnC4kRVetI/AAAAAAAAATA/yZn0T0dC0NQ/s1600/raffles+then.jpg","credit":"","caption":""}},{"startDate":"1949","headline":"Opening Of Malaya University in Singapore","text":"The establishment of the first university in Singapore started due to a shortage of medical assistants in Singapore and Penang during the late 1890s. The school was located in the old Female Lunatic Asylum near the Singapore General Hospital at Sepoy Lines near New Bridge Road, where four of the asylum buildings were converted into a medical school. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/University_of_Malaya'>Source</a>","asset":{"media":"http://youtu.be/_QcsgqXzdkE","credit":"","caption":""}},{"startDate":"1954","headline":"Introduction of polytechnic education","text":"Singapore Polytechnic is the first polytechnic established in Singapore. It was founded on 27 October 1954 to provide studies, training and research in technology, science, commerce and the arts. It was originally located at Prince Edward Road and was relocated to its present-day location at Dover next to Dover MRT Station in 1978.\n\nSince then, over 177,000 students have graduated from Singapore Polytechnic.\n<br /><a target='_blank' href='http://en.wikipedia.org/wiki/Singapore_Polytechnic'>Source</a>","asset":{"media":"http://myspmemories.sp.edu.sg/files/2014/04/Success_SP-Formation-1-217x300.jpg","credit":"","caption":"The 56 page Dobby report (1953), one of the documents that outlined the proposal of the setting up of the Singapore Polytechnic."}},{"startDate":"1956","headline":"Nanyang University (Nantah) admitted its first batch of students","text":"Nanyang university started classes on 30 March 1956, following a simple flag-raising ceremony officiated by Tan Lark Sye two weeks earlier on 15 March. \n<br /><a target='_blank' href='http://eresources.nlb.gov.sg/infopedia/articles/SIP_91_2005-02-02.html'>Source</a>","asset":{"media":"http://www.theonlinecitizen.com/wp-content/uploads/2014/08/Nantah-gate.jpg","credit":"","caption":"Front Entrance of Nanyang University"}},{"startDate":"1960","headline":"The bilingualism policy in schools was officially introduced ","text":"The bilingualism policy in schools was officially introduced in 1960, for English to be the official language for both national integration and utilitarian purposes.The bilingual policy was first adopted in 1966. One of its primary objectives is to promote English as the common language among the diverse ethnic groups in Singapore. English language was also seen as a primary utilitarian tool in Singapore’s effort to make the world its marketplace. \n<br /><a target='_blank' href='http://en.wikipedia.org/wiki/Education_in_Singapore'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=XEKPotJOizk","credit":"This video is edited from the original video uploaded by user tohlamtiong.","caption":""}},{"startDate":"1961","headline":"Public Service Commission (PSC) Scholarships","text":"In 1961, PSC took over the selection of candidates for all scholarships, fellowships and training courses offered or sponsored by the Singapore Government. In 1963, PSC set up a Scholarships Co-ordinating Committee and a Scholarship Unit. <br /><a target='_blank' href='http://archive.today/CYge'>Source</a>","asset":{"media":"http://www.pscscholarships.gov.sg/etc/designs/pscsch/template/contentpage/images/history/1960/5.jpg","credit":"","caption":""}},{"startDate":"1962","headline":"University of Singapore (SU) set up after split from University of Malaya","text":"","asset":{"media":"http://www.fas.nus.edu.sg/anniversary/images/econ-1964.jpg","credit":"NUS","caption":""}},{"startDate":"1963","headline":"A new school building namely Singapore School for the Deaf in 1963","text":"","asset":{"media":"http://youtu.be/Rls6MTX36xU","credit":"","caption":""}},{"startDate":"1965","headline":"Interactive Graph: Education expenditure","text":"In the first year of its independence, the Singapore Government allotted 59 per cent of the annual education budget on primary education, 27 per cent on secondary education and 14 per cent on higher education. The table shows the annual expenditure on education during the years 1981 to 2012. Expenditure on education has increased over the past years; for FY2012 it is $10.5 billion, equivalent to 3.1% of our GDP, and accounting for more than 20% of government expenditure. <br /><a target='_blank' href='http://siteresources.worldbank.org/EDUCATION/Resources/278200-1121703274255/1439264-1153425508901/Development_Edu_Singapore_draft.pdf'>Source1</a>  <a target='_blank' href='http://www.moe.gov.sg/media/parliamentary-replies/2013/10/government-expenditure-on-education.php'>Source2</a>","asset":{"media":"<iframe src='http://www.thiakx.com/misc/educity/dashboardCharts/govtExpend.html' />","credit":"","caption":""}},{"startDate":"1969","headline":"Introduction of junior college education","text":"National Junior College was the first junior college established by the Ministry of Education in 1969. 574 students made up the pioneer batch of students.  <br /><a target='_blank' href='http://en.wikipedia.org/wiki/National_Junior_College'>Source</a>","asset":{"media":"https://www.youtube.com/watch?v=yzxeWdMyUuM","credit":"","caption":""}},{"startDate":"1979","headline":"New Education System \n(NES) was introduced","text":"To support the drive towards sustainable development and reflecting the economic restructuring strategies, education was revamped to have a new emphasis \non efficiency. A New Education System (NES) was introduced in January 1979 to reduce educational wastage. <br><br>The NES provided for three streams in both primary and secondary school, to allow pupils to progress at a pace more suited to their abilities. Slower primary pupils were allowed up to eight years to complete primary education, while secondary pupils could take up \nto five years to acquire the General Certificate in Education (GCE) “Ordinary” Level and a further three years for the “Advanced” Level. A new lower secondary \nschool leaving certificate, the GCE “Normal” was introduced. <br><br>In manpower terms, the effect of the NES was to enable each pupil to go as far as possible in school, \nand thereby achieve the best possible educational take off for training and employment. <br /><a target='_blank' href='http://siteresources.worldbank.org/EDUCATION/Resources/278200-1121703274255/1439264-1153425508901/Development_Edu_Singapore_draft.pdf'>Source</a>","asset":{"media":"http://www.todayonline.com/sites/default/files/styles/photo_gallery_image_lightbox/public/17634669.JPG?itok=NYklIDxA","credit":"http://www.todayonline.com/sites/default/files/styles/photo_gallery_image_lightbox/public/17634669.JPG?itok=NYklIDxA","caption":""}},{"startDate":"1979","headline":"Greater percentage of students enrolling in English streams","text":" In 1959 only 47 per cent of children entering primary one were in the English stream while 46 per cent were in Chinese schools. Twenty years \nlater (in 1979), the English stream enrolled 91 per cent of all primary one children with only 9 per cent in the Chinese stream and a negligible number in the Tamil \nand Malay language streams.  <br /><a target='_blank' href='http://siteresources.worldbank.org/EDUCATION/Resources/278200-1121703274255/1439264-1153425508901/Development_Edu_Singapore_draft.pdf'>Source</a>","asset":{"media":"http://www.todayonline.com/sites/default/files/styles/photo_gallery_image_lightbox/public/17776856.JPG?itok=mUR-Tt4z","credit":"","caption":""}},{"startDate":"1981","headline":"Interactive Graph: Student to teacher Ratio","text":"We can see a general falling trend in students per teacher ratio over the years. This is a good trend, as smaller classrooms means teachers might have more time per student","asset":{"media":"<iframe src='http://thiakx.com/misc/educity/dashboardCharts/teacher.html' />","credit":"Mouse over the graph to see the values","caption":""}},{"startDate":"1987","headline":"English was officially designated the first language","text":"The main language of instruction in Singapore is English, which was officially designated the first language within the local education system in 1987. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Education_in_Singapore'>Source</a>","asset":{"media":"http://c.tadst.com/gfx/600x400/english-language-day.jpg?1","credit":"","caption":""}},{"startDate":"1988","headline":"First independent schools - ACS, SJI, & TCH established. SCGS & MGS became independent in 1989; RI in 1990; and RGS & Nanyang Girls’ in 1993.","text":"In 1988, the MOE started its indepdent school programme. Independent schools are allowed to be privately funded and subject to less government regulation in setting out their curriculum. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Anglo-Chinese_School_(Independent)'>Source</a>","asset":{"media":"http://www.thiakx.com/misc/educity/img/acs_sji_hci.png","credit":"","caption":""}},{"startDate":"1991","headline":"Introduction of Streaming at end of P4 (EM1, EM2 and EM3) and removal of P3 streaming","text":"Streaming was moved back to the end of Primary 4 in 1992 and the existing streams were replaced by EM1, EM2 and EM3. The first two assume English-language proficency and separate students by their levels of proficency in 'Mother Tongue'. EM3 teaches only a basic 'Foundation' level of both English and 'Mother Tongue'. <br /><a target='_blank' href='http://books.google.com.sg/books?id=J67Flara3MIC&pg=PA154&lpg=PA154#v=onepage&q&f=false'>Source</a>","asset":{"media":"http://upload.wikimedia.org/wikipedia/en/e/e3/I_Not_Stupid.jpg","credit":"http://upload.wikimedia.org/wikipedia/en/e/e3/I_Not_Stupid.jpg","caption":""}},{"startDate":"1991","headline":"Upgrading of NTI to Nanyang Technological University (NTU)","text":"In 1991, NTI merged with the National Institute of Education to form Nanyang Technological University (NTU). The alumni rolls of the former Nanyang University were transferred to NTU in 1996. <br /><a target='_blank' href='http://www.ntu.edu.sg/AboutNTU/CorporateInfo/Pages/OurHistory.aspx'>Source</a>","asset":{"media":"http://www.todayonline.com/sites/default/files/styles/photo_gallery_image_lightbox/public/17783655.JPG?itok=tqyZN_u5","credit":"http://www.todayonline.com/sites/default/files/styles/photo_gallery_image_lightbox/public/17783655.JPG?itok=tqyZN_u5","caption":""}},{"startDate":"1992","headline":"Institute of Technical Education (ITE) established","text":"The Institute of Technical Education (ITE), Singapore, was established as a post-secondary education institution in 1992 under the Ministry of Education. ITE is a principal provider of career and technical education and key developer of national occupational skills certification and standards to enhance Singapore's workforce competitiveness. <br /><a target='_blank' href='https://www.ite.edu.sg/wps/portal/aboutite/'>Source</a>","asset":{"media":"https://emp.jobscentral.com.sg/img/company_logo/7405_logo.jpg","credit":"https://emp.jobscentral.com.sg/img/company_logo/7405_logo.jpg","caption":""}},{"startDate":"1995","headline":"Interactive Graph: Post Secondary Education","text":"The graph shows the progress of students attaining higher than secondary education, separated by race. We observe that over the years, Malays have made tremendous improvement, closing the gap with their Chinese & Indian counterparts","asset":{"media":"<iframe src='http://thiakx.com/misc/educity/dashboardCharts/race.html' />","credit":"Mouse over the graph to see the values","caption":""}},{"startDate":"1997","headline":"Thinking Schools, Learning Nations","text":"In 1997, the Singapore education system started to change into an ability-driven one after then Prime Minister Goh Chok Tong outlined his 'Thinking Schools, Learning Nations' vision. Under this policy, more emphasis was given to national education, creative thinking, collaborative learning as well as ICT literacy. Schools became more diverse and were given greater autonomy in deciding their own curriculum and developing their own niche areas. Differences between the various academic streams became blurred. <br><br>The Ministry of Education also officially acknowledged that 'excellence' will not be measured solely in terms of academics; a mountain range of excellence – with many peaks'. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Education_in_Singapore'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=1mEkaH3mBjA","credit":"","caption":""}},{"startDate":"2000","headline":"Singapore Management University (SMU) incorporated","text":"SMU was officially incorporated on 12 January 2000, and was Singapore's first autonomous government-funded university. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Singapore_Management_University'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=dPtoKIUTiiA&list=PLSebW9b7q6FYySEIOhP94GCG5FOEnBNOF&index=3","credit":"SMU","caption":""}},{"startDate":"2000","headline":"Compulsory Education Act","text":"In 2000 the Compulsory Education Act codified compulsory education for children of primary school age (excepting those with disabilities), and made it a criminal offence for parents to fail to enroll their children in school and ensure their regular attendance.<br><br> Exemptions are allowed for homeschooling or full-time religious institutions, but parents must apply for exemption from the Ministry of Education and meet a minimum benchmark. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Education_in_Singapore'>Source</a>","asset":{"media":"http://www.straitstimes.com/the-big-story/case-you-missed-it/story/going-door-door-get-kids-school-20131226","credit":"http://www.straitstimes.com/the-big-story/case-you-missed-it/story/going-door-door-get-kids-school-20131226","caption":"Going door to door to get kids to school"}},{"startDate":"2004","headline":"A 'Global Schoolhouse'","text":"The government's plan, which was initiated in 2002, is to make Singapore a 'Global Schoolhouse', attracting revenue-generating international students. In 2002, the education sector accounted for 3.6% of Singapore's economy. The government's aim was to grow this sector to 5% of Singapore's economy over the subsequent decade. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Education_in_Singapore#Singapore_as_a_.22Global_Schoolhouse.22'>Source</a>","asset":{"media":"http://www.iesingapore.gov.sg/~/media/IE%20Singapore/Images/Venture%20Overseas/Browse%20by%20Sector/Education.jpg","credit":"","caption":""}},{"startDate":"2004","headline":"Singapore Sports School admits its first batch of students in 2004","text":"Singapore Sports School is a Specialised Independent School under the auspices of the Ministry of Culture, Community and Youth (MCCY). It is the only school in Singapore that offers select youths an integrated academic and sports programme in a world-class environment. It was officially opened on 2 April 2004 by Mr Goh Chok Tong, Singapore’s second Prime Minister. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Singapore_Sports_School'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=YUeNFcFQIe8","credit":"http://www.youtube.com/watch?v=YUeNFcFQIe8","caption":""}},{"startDate":"2004","headline":"“Teach Less, Learn More” ","text":"Teach Less Learn More initiative was introduced by PM Lee during National Day Rally 2004. This initiative moved instruction further away from the rote memorization and repetitive tasks on which it had originally focused to deeper conceptual understanding and problem-based learning. <br /><a target='_blank' href='http://www.ncee.org/programs-affiliates/center-on-international-education-benchmarking/top-performing-countries/singapore-overview/'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=zzYmDPMy6FQ","credit":"http://www.youtube.com/watch?v=zzYmDPMy6FQ","caption":""}},{"startDate":"2004","headline":"Introduction of Integrated Programme (IP)","text":"The Integrated Programme (or IP) is a scheme that allows high-performing students in secondary schools in Singapore to skip the GCE Ordinary Level (O-level) examination (typically taken by students at the end of their fourth or fifth year in secondary school) and proceed to sit for the GCE Advanced Level (A-level) examination, International Baccalaureate (IB), or an equivalent examination, after six years of secondary education. The A-level examination is typically taken by students at the end of their second or third year in junior college. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Integrated_Programme'>Source</a>","asset":{"media":"http://education.asiaone.com/sites/default/files/public/styles/article_main_620_400/public/article/images/education_photo_5/1267128.jpg","credit":"http://education.asiaone.com/sites/default/files/public/styles/article_main_620_400/public/article/images/education_photo_5/1267128.jpg?itok=YK8j0KVW","caption":""}},{"startDate":"2005","headline":"NUS High School of Mathematics and Science admits its first batch of students in 2005","text":"NUS High School of Math and Science is a specialised independent high school in Singapore offering a six-year Integrated Programme (IP) leading to the NUS High School Diploma, which is recognized by the National University of Singapore (NUS) (its parent institution), Nanyang Technological University (NTU), Singapore Management University (SMU) and top overseas universities in the Ivy League, Oxbridge, and others.<br><br>\n\nThe school offers an accelerated mathematics and science curriculum integrated with language, humanities, arts, sports, co-curricular activities, in a modular system. It is the second specialized school in Singapore after the Singapore Sports School. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/NUS_High_School_of_Math_and_Science'>Source</a>","asset":{"media":"http://upload.wikimedia.org/wikipedia/commons/9/91/NUSHigh-Campus.JPG","credit":"http://upload.wikimedia.org/wikipedia/commons/9/91/NUSHigh-Campus.JPG","caption":""}},{"startDate":"2007","headline":"Interactive Graph: Gender Parity","text":"Gender Parity is the ratio of females to males students among the different education levels. We observe that in 1990s, there are more males than female students in tertiary institutes. Interestingly, the trend reverses from 2007 onwards, where we observe a larger number of females than male students in tertiary institutes.","asset":{"media":"<iframe src='http://thiakx.com/misc/educity/dashboardCharts/parity.html' />","credit":"Mouse over the graph to see the values","caption":""}},{"startDate":"2007","headline":"Establishment of NorthLight School (Specialised School)","text":"Northlight School (Chinese: 北烁学校) is a school in Singapore established by the Ministry of Education (MOE) for students with difficulties handling the mainstream curriculum in the country. The school started its operations formally in January 2007 to assist students at risk of dropping out of school. Admission to the school is based on at least two failed attempts at the Primary School Leaving Examinations (PSLE). The school also accepts those who have yet to complete secondary education. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Northlight_School'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=XJHHkw8JUgA","credit":"http://www.youtube.com/watch?v=XJHHkw8JUgA","caption":""}},{"startDate":"2008","headline":"Introduction of Subject-based Banding beginning with the 2008 P5 cohort to replace the EM3 stream","text":"Starting from the 2008 Primary 5 cohort, primary schools will introduce Subject-based Banding to replace the current EM3 stream.<br><br>\n\nCurrently EM3 stream students offer the Foundation level for all subjects. With Subject-based Banding, students will be able to offer a mix of Standard or Foundation subjects depending on their aptitude in each subject.<br><br>\n\nFor instance, if a student is weak in English and Mathematics, he can choose to take English and Mathematics at the Foundation level while taking Mother Tongue Language and Science at the Standard level. <br /><a target='_blank' href='http://www.moe.gov.sg/education/primary/changes/'>Source</a>","asset":{"media":"http://parents-in-education.moe.gov.sg/pie/slot/u1/Primary%20Education/3.jpg","credit":"http://www.moe.gov.sg/education/primary/changes/#subject-based-banding","caption":""}},{"startDate":"2008","headline":"School of The Arts (SOTA) admits its first batch of students in 2008","text":"The School of the Arts is the nation's first independent, pre-tertiary \narts school to offer a unique connected arts and academic curriculum for\n youths aged 13-18. <br /><a target='_blank' href='http://www.esplanade.com/whats_on/programme_info/cool_classics_chamber_music/index.jsp'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=7-FOxRXdJKY","credit":"","caption":""}},{"startDate":"2009","headline":"Assumption Vocational Institute remodeled to form the Assumption Pathway School (Specialised School)","text":"The Ministry of Education (MOE) has been working with the Institute of Technical Education (ITE) and the St Gabriel’s Foundation to enhance and reorient the programme currently available at the Assumption Vocational Institute (AVI). AVI will be transformed into Assumption Pathway School (APS) and run the enhanced programme in January 2009. One distinctive feature of the enhanced programme is the residential programme which all students experience for two weeks in each year.\n<br><br>\nAPS will admit students who have failed the Primary School Leaving Examinations (PSLE) once or more, as well as students who prematurely leave secondary school. Applications by students who have failed the PSLE once will be considered based on the recommendations of their primary school principals. <br /><a target='_blank' href='http://www.moe.gov.sg/media/press/2008/03/assumption-pathway-school-to-s.php'>Source</a>","asset":{"media":"https://hairforhope.org.sg/uploads/grouplogos/5.png","credit":"http://www.moe.gov.sg/media/press/2008/03/assumption-pathway-school-to-s.php","caption":""}},{"startDate":"2009","headline":"Singapore Institute of Technology (SIT) established and admits its first batch of students in 2010","text":"The Singapore Institute of Technology is Singapore's fifth autonomous university in Singapore.<br><br>\n\nEstablished in 2009, the university primarily caters to local polytechnic graduates who desire to pursue a bachelor's degree. The university offers specialised degree programmes in Physical Science & Engineering, Food Science & Chemical Engineering, Information Communications & Computing, Health Sciences and Design, Education and Social Sciences through collaboration with overseas university partners and the five local polytechnics. <br /><a target='_blank' href='http://en.wikipedia.org/wiki/Singapore_Institute_of_Technology'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=ZHUpi_gVibk","credit":"","caption":""}},{"startDate":"2009","headline":"Singapore University of Technology and Design (SUTD) incorporated and admits its first batch of students in 2012","text":"The Singapore University of Technology and Design (新科大) is Singapore's fourth autonomous university. It is developed in collaboration with Massachusetts Institute of Technology. SUTD's mission is to advance knowledge and nurture technically grounded leaders and innovators to serve societal needs. This will be accomplished with a focus on Design, through an integrated multi-disciplinary curriculum and multi-disciplinary research.\n<br><br>\nThe University, also in collaboration with Zhejiang University (ZJU) and Singapore Management University (SMU), is distinguished by its unique East and West academic programme which incorporates elements of technology, entrepreneurship, management and design thinking. It also offers an MIT-SUTD Dual Masters' Degree Programme; a full-time programme leading to a degree from MIT and another from SUTD. Graduate opportunities also include the SUTD PhD Programme.","asset":{"media":"http://www.youtube.com/watch?v=QXkVcEscwhA","credit":"","caption":""}},{"startDate":"2010","headline":"School of Science and Technology (SST) admits its first batch of students in 2010","text":"The pioneer cohort of SST students begins school. The exciting array of \nactivities on the first day of school includes the Bridge Building \nactivity, the Amazing Race and the overnight camp. The key cornerstone \nof the Orientation Camp is the annual Badge Ceremony, where students \nreceive the collar pins to reaffirm their status as SST students. <br /><a target='_blank' href='http://www.sst.edu.sg/about-sst/history-of-sst/'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=drENfBBuKvI","credit":"http://www.sst.edu.sg/about-sst/history-of-sst/","caption":""}},{"startDate":"2013","headline":"The Official Opening of SST","text":"Deputy Prime Minister and Minister of Finance Mr Tharman Shanmugaratnam attends the ceremony together with a few other distinguished guests such as Dr. Su Guaning, SST’s Chairman and President Emeritus at Nanyang Technological University (NTU). Highlights include a lion dance, a P.E.T water rocket salute and a flash mob by the students and an LED light dance performance by the SST Show Choir. <br /><a target='_blank' href='http://www.sst.edu.sg/about-sst/history-of-sst/'>Source</a>","asset":{"media":"www.youtube.com/watch?v=fZkHIUV8mGc","credit":"","caption":""}},{"startDate":"2014","headline":"MOE kindergartens set up in HDB heartlands","text":"The Education Ministry will set up its first batch of pilot kindergartens within HDB heartlands - four in primary schools and one at a void deck.\n<br><br>\nThe sites are Blangah Rise Primary, Dazhong Primary, Farrer Park Primary, Punggol View Primary, and Block 489C Tampines Street 45.\n<br><br>\nEducation Minister Heng Swee Keat said: 'Some of these kindergartens will be in primary schools and in that way we'll look at how we can improve the transition between preschool and primary school. But at the same time, we're also having it in community sites, which will allow us to test out a number of different ideas as well.' <br /><a target='_blank' href='https://www.youtube.com/watch?v=8XuCTQFQNwo'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=8XuCTQFQNwo","credit":"","caption":""}},{"startDate":"2014","headline":"Spectra Secondary (Specialised School) admits its first batch of students","text":"Spectra Secondary School, the new specialised school for Normal Technical students, will take in their first batch of Secondary One students from January 2014. The school will provide a customised and practiced-oriented curriculum to suit the learning needs of our students. They will also work closely with the Institute of Technical Education (ITE) and industry partners to develop programmes and attachment opportunities for our students. <br /><a target='_blank' href='http://www.spectra.edu.sg/about-spectra/school-info'>Source</a>","asset":{"media":"http://www.youtube.com/watch?v=oZp_TKF0RSQ","credit":"http://www.spectra.edu.sg/about-spectra/school-info","caption":""}},{"startDate":"2014","headline":"Education, the key to a Smarter Nation","text":"The education system has benefited many people by laying the foundation of success for Singapore and it will be key to a smarter and better nation!","asset":{"media":"http://cdn-static.zdnet.com/i/library/sg-thumbs/singapore-merlion-thumb620x465.jpg","credit":"","caption":""}}]}} 
